In [50]:
import pandas as pd
import numpy as np

In [51]:
df1 = pd.read_csv(r"Movie Dataset\titles.csv")

In [52]:
df1.shape

(5850, 15)

In [53]:
df1.head()

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
0,ts300399,Five Came Back: The Reference Films,SHOW,This collection includes 12 World War II-era p...,1945,TV-MA,51,['documentation'],['US'],1.0,NaN,NaN,NaN,0.600,NaN
1,tm84618,Taxi Driver,MOVIE,A mentally unstable Vietnam War veteran works ...,1976,R,114,"['drama', 'crime']",['US'],NaN,tt0075314,8.2,808582.0,40.965,8.179
2,tm154986,Deliverance,MOVIE,Intent on seeing the Cahulawassee River before...,1972,R,109,"['drama', 'action', 'thriller', 'european']",['US'],NaN,tt0068473,7.7,107673.0,10.010,7.300
3,tm127384,Monty Python and the Holy Grail,MOVIE,"King Arthur, accompanied by his squire, recrui...",1975,PG,91,"['fantasy', 'action', 'comedy']",['GB'],NaN,tt0071853,8.2,534486.0,15.461,7.811
4,tm120801,The Dirty Dozen,MOVIE,12 American military prisoners in World War II...,1967,NaN,150,"['war', 'action']","['GB', 'US']",NaN,tt0061578,7.7,72662.0,20.398,7.600

In [54]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5850 entries, 0 to 5849
Data columns (total 15 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    5850 non-null   object
 1   title                 5849 non-null   object
 2   type                  5850 non-null   object
 3   description           5832 non-null   object
 4   release_year          5850 non-null   int64
 5   age_certification     3231 non-null   object
 6   runtime               5850 non-null   int64
 7   genres                5850 non-null   object
 8   production_countries  5850 non-null   object
 9   seasons               2106 non-null   float64
 10  imdb_id               5447 non-null   object
 11  imdb_score            5368 non-null   float64
 12  imdb_votes            5352 non-null   float64
 13  tmdb_popularity       5759 non-null   float64
 14  tmdb_score            5539 non-null   float64
dtypes: float64(5), int64(2), object(8)
memory usage: 685.7+ KB

In [55]:
df1.describe()

,release_year,runtime,seasons,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
count,5850.000000,5850.000000,2106.000000,5368.000000,5.352000e+03,5759.000000,5539.000000
mean,2016.417094,76.888889,2.162868,6.510861,2.343938e+04,22.637925,6.829175
std,6.937726,39.002509,2.689041,1.163826,9.582047e+04,81.680263,1.170391
min,1945.000000,0.000000,1.000000,1.500000,5.000000e+00,0.009442,0.500000
25%,2016.000000,44.000000,1.000000,5.800000,5.167500e+02,2.728500,6.100000
50%,2018.000000,83.000000,1.000000,6.600000,2.233500e+03,6.821000,6.900000
75%,2020.000000,104.000000,2.000000,7.300000,9.494000e+03,16.590000,7.537500
max,2022.000000,240.000000,42.000000,9.600000,2.294231e+06,2274.044000,10.000000

In [56]:
df1.isnull().sum()

id                         0
title                      1
type                       0
description               18
release_year               0
age_certification       2619
runtime                    0
genres                     0
production_countries       0
seasons                 3744
imdb_id                  403
imdb_score               482
imdb_votes               498
tmdb_popularity           91
tmdb_score               311
dtype: int64

In [57]:
df1 = df1.dropna(subset = "title")
df1["description"] = df1["description"].fillna("No Description Available")
df1["age_certification"] = df1["age_certification"].fillna("Unrated")
df1["imdb_score"] = df1["imdb_score"].fillna(df1["imdb_score"].mean())
df1["imdb_votes"] = df1["imdb_votes"].fillna(df1["imdb_votes"].mean())
df1["tmdb_popularity"] = df1["tmdb_popularity"].fillna(df1["tmdb_popularity"].mean())
df1["tmdb_score"] = df1["imdb_score"].fillna(df1["tmdb_score"].mean())

In [58]:
df1.isnull().sum()

id                         0
title                      0
type                       0
description                0
release_year               0
age_certification          0
runtime                    0
genres                     0
production_countries       0
seasons                 3743
imdb_id                  403
imdb_score                 0
imdb_votes                 0
tmdb_popularity            0
tmdb_score                 0
dtype: int64

In [59]:
df1 = df1.drop(columns = ["seasons", "imdb_id"])

In [60]:
df1.isnull().sum()

id                      0
title                   0
type                    0
description             0
release_year            0
age_certification       0
runtime                 0
genres                  0
production_countries    0
imdb_score              0
imdb_votes              0
tmdb_popularity         0
tmdb_score              0
dtype: int64

In [61]:
df1.isnull().sum().sum() #Now No Null Values in our dataset

0

In [62]:
df1.columns

Index(['id', 'title', 'type', 'description', 'release_year',
       'age_certification', 'runtime', 'genres', 'production_countries',
       'imdb_score', 'imdb_votes', 'tmdb_popularity', 'tmdb_score'],
      dtype='object')

In [63]:
df1[df1.duplicated(subset = "id")].shape[0] #No duplicates in our primary key i.e ID

0

In [64]:
df1[df1.duplicated(subset = ['id', 'title', 'type', 'description', 'release_year',
       'age_certification', 'runtime', 'genres', 'production_countries',
       'imdb_score', 'imdb_votes', 'tmdb_popularity',
       'tmdb_score'])].shape[0]
#No duplicate Rows

0

In [65]:
#As there is no revnenue column, so we are creating a random sample of revenue
np.random.seed(2)
df1['Revenue(In Millions)'] = np.random.randint(1, 301, df1.shape[0])

print(df1[['id', 'Revenue(In Millions)']].head())

         id  Revenue(In Millions)
0  ts300399                   169
1   tm84618                    16
2  tm154986                    73
3  tm127384                    23
4  tm120801                   300

In [66]:
df1.head(5)

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,imdb_score,imdb_votes,tmdb_popularity,tmdb_score,Revenue(In Millions)
0,ts300399,Five Came Back: The Reference Films,SHOW,This collection includes 12 World War II-era p...,1945,TV-MA,51,['documentation'],['US'],6.510861,23439.382474,0.600,6.510861,169
1,tm84618,Taxi Driver,MOVIE,A mentally unstable Vietnam War veteran works ...,1976,R,114,"['drama', 'crime']",['US'],8.200000,808582.000000,40.965,8.200000,16
2,tm154986,Deliverance,MOVIE,Intent on seeing the Cahulawassee River before...,1972,R,109,"['drama', 'action', 'thriller', 'european']",['US'],7.700000,107673.000000,10.010,7.700000,73
3,tm127384,Monty Python and the Holy Grail,MOVIE,"King Arthur, accompanied by his squire, recrui...",1975,PG,91,"['fantasy', 'action', 'comedy']",['GB'],8.200000,534486.000000,15.461,8.200000,23
4,tm120801,The Dirty Dozen,MOVIE,12 American military prisoners in World War II...,1967,Unrated,150,"['war', 'action']","['GB', 'US']",7.700000,72662.000000,20.398,7.700000,300

In [67]:
df1.to_csv('Data_Clean_Titles.csv', index = False)

In [68]:
df2 = pd.read_csv(r'Movie Dataset\credits.csv')

In [69]:
df2.isnull().sum()

person_id       0
id              0
name            0
character    9772
role            0
dtype: int64

In [70]:
df2['character'] = df2['character'].fillna('Unknown')

In [71]:
df2[df2.duplicated()].shape[0] #No duplicate Rows

0

In [72]:
df2[df2.duplicated(subset = 'person_id')].shape[0]

23212

In [73]:
df2.isnull().sum()

person_id    0
id           0
name         0
character    0
role         0
dtype: int64

In [74]:
df2.to_csv('Data_Clean_Credits.csv', index = False)